fixing archetecture diagram
